{
  "Contact Information": {
    "Name": "Kushagra Wadhwa",
    "Phone": "+91-7428739746",
    "Email": "wadhwakushagra263@gmail.com",
    "LinkedIn": "https://linkedin.com/in/kushagra-wadhwa-864319229/",
    "GitHub": "https://github.com/KushagraaWadhwa"
  },
  "Summary": "Technologist with a passion for solving complex user problems and leading products from idea to impact. Proven ability to own the lifecycle of production-grade AI solutions, from identifying user needs and architecting features. Combines hands-on AI engineering experience with a strong entrepreneurial drive to guide products from conception to launch.",
  "Education": [
    {
      "Degree": "Bachelor of Technology in Artificial Intelligence and Machine Learning",
      "University": "Guru Gobind Singh Indraprastha University, New Delhi",
      "Year": "2021–2025"
    }
  ],
  "Skills": [
    "Python",
    "JavaScript",
    "Generative AI",
    "RAG Pipelines",
    "Hugging Face",
    "OpenAI API",
    "Semantic Search",
    "Summarization",
    "FastAPI",
    "Flask",
    "REST APIs",
    "Microsoft Teams Bot Framework",
    "WebSockets",
    "SQL",
    "MongoDB",
    "Pinecone",
    "ChromaDB",
    "Elasticsearch",
    "Apache NiFi",
    "n8n"
  ],
  "Work Experience": [
    {
      "Company": "ShorthillsAI",
      "Role": "Software Engineer",
      "Duration": "July 2025 – Present",
      "Responsibilities": [
        "Owned the complete product lifecycle of the \"HR Resume Assistant,\" an AI-powered bot deployed on Microsoft Teams to streamline recruitment workflows for HR professionals.",
        "Led the design of core features including AI-driven resume generation and semantic candidate search, and architected the user experience using Microsoft Teams Adaptive Cards to create an intuitive interface.",
        "Spearheaded the development of the core Generative AI engine for a \"Real-Time Earnings Call Intelligence Platform,\" an internal tool for financial analysts.",
        "Engineered features for real-time speaker identification, summarization of key financial segments, and automated alert generation, directly enabling fund managers to make faster, data-driven decisions.",
        "Currently leading an automation initiative for the DataDog platform to generate enhanced analysis reports for a key client, aiming to provide deeper observability and actionable insights."
      ]
    },
    {
      "Company": "ShorthillsAI",
      "Role": "Software Engineer Intern",
      "Duration": "Feb 2025 – June 2025",
      "Responsibilities": [
        "Developed foundational automation workflows using Apache NiFi and n8n, which became the backend engine for the HR Resume Assistant Bot, proving the business case for the full product."
      ]
    },
    {
      "Company": "ProdigalAI",
      "Role": "AI Project Intern",
      "Duration": "Sep 2024 – Nov 2024",
      "Responsibilities": [
        "Addressed user pain points in accessing information from unstructured documents by developing a domain-specific chatbot; owned the project from conception, utilizing LlamaIndex and Gemini within a RAG pipeline to improve query retrieval accuracy."
      ]
    },
    {
      "Company": "Deutsche Telekom Digital Labs",
      "Role": "Data Scientist Intern",
      "Duration": "Jun 2024 – Aug 2024",
      "Responsibilities": [
        "Led the design of a non-LLM document parser to solve data extraction challenges, achieving over 95% coverage from complex HR forms and delivering a real-time analytics dashboard to stakeholders using Streamlit."
      ]
    }
  ],
  "Projects": [
    {
      "Name": "Smart Learning Engine with RAG and Vector Search",
      "Description": "Addressed poor content discoverability for users on an educational platform by designing a smart retrieval system that mapped queries to syllabus topics using semantic similarity. Owned the technical strategy, using Pinecone for high-speed vector search across video and article embeddings to deliver the single most relevant piece of content, measurably improving user satisfaction.",
      "Technologies Used": "Python, Pinecone, Langchain, FastAPI"
    },
    {
      "Name": "LLM-Powered Sales Assistant with Voice Integration",
      "Description": "Identified a key challenge for sales teams: needing instant, accurate answers during live customer calls. Led the creation of a voice-enabled AI assistant that fetches information from internal product manuals using a RAG architecture, empowering sales reps with context-aware responses and reducing customer query handling time.",
      "Technologies Used": "OpenAI Whisper, RAG, ChromaDB"
    }
  ],
  "Certifications": [
    "GATE DA 2025 (AIR 663)",
    "Diploma in Programming and Data Science - IIT Madras (2024)",
    "Postman API Fundamental Student Expert (2023)"
  ],
  "Extracted Links": [
    "mailto:wadhwakushagra263@gmail.com",
    "https://github.com/KushagraaWadhwa",
    "https://linkedin.com/in/kushagra-wadhwa-864319229/"
  ]
}