{
  "Work_Experience": [
    {
      "Title": "Software Engineer",
      "Company": "ShorthillsAI",
      "Location": "Remote",
      "Start_Date": "July 2025",
      "End_Date": "Present",
      "Responsibilities": [
        [
          "Owned the complete product lifecycle of the \"HR Resume Assistant,\" an AI-powered bot deployed on Microsoft Teams to streamline recruitment workflows for HR professionals.",
          "Led the design of core features including AI-driven resume generation and semantic candidate search, and architected the user experience using Microsoft Teams Adaptive Cards to create an intuitive interface.",
          "Spearheaded the development of the core Generative AI engine for a \"Real-Time Earnings Call Intelligence Platform,\" an internal tool for financial analysts.",
          "Engineered features for real-time speaker identification, summarization of key financial segments, and automated alert generation, directly enabling fund managers to make faster, data-driven decisions.",
          "Currently leading an automation initiative for the DataDog platform to generate enhanced analysis reports for a key client, aiming to provide deeper observability and actionable insights."
        ]
      ],
      "Technologies_Used": []
    },
    {
      "Title": "Software Engineer Intern",
      "Company": "ShorthillsAI",
      "Location": "Remote",
      "Start_Date": "Feb 2025",
      "End_Date": "June 2025",
      "Responsibilities": [
        [
          "Developed foundational automation workflows using Apache NiFi and n8n, which became the backend engine for the HR Resume Assistant Bot, proving the business case for the full product."
        ]
      ],
      "Technologies_Used": []
    },
    {
      "Title": "AI Project Intern",
      "Company": "ProdigalAI",
      "Location": "Remote",
      "Start_Date": "Sep 2024",
      "End_Date": "Nov 2024",
      "Responsibilities": [
        [
          "Addressed user pain points in accessing information from unstructured documents by developing a domain-specific chatbot; owned the project from conception, utilizing LlamaIndex and Gemini within a RAG pipeline to improve query retrieval accuracy."
        ]
      ],
      "Technologies_Used": []
    },
    {
      "Title": "Data Scientist Intern",
      "Company": "Deutsche Telekom Digital Labs",
      "Location": "Remote",
      "Start_Date": "Jun 2024",
      "End_Date": "Aug 2024",
      "Responsibilities": [
        [
          "Led the design of a non-LLM document parser to solve data extraction challenges, achieving over 95% coverage from complex HR forms and delivering a real-time analytics dashboard to stakeholders using Streamlit."
        ]
      ],
      "Technologies_Used": []
    }
  ]
}